{
  "backend/main.mo": "Motoko backend canister defining user profiles, wallets, investments, transactions, referral earnings, and access‑controlled methods for managing them.",
  "feature_evidence.json": "Feature evidence report listing deployment‑related features, affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of multiple frontend source files describing UI components, pages, and styling.",
  "frontend/docs/deployment-failure-investigation.md": "Documentation detailing a frontend deployment failure, its root cause, required fixes, and verification steps.",
  "frontend/index.css": "Tailwind-based global styles defining OKLCH theme variables and dark/light mode tokens.",
  "frontend/index.html": "Base HTML entrypoint loading the frontend root and main TypeScript bundle.",
  "frontend/scripts/predeploy-verify.sh": "Shell script that checks required frontend files, runs TypeScript checks, and performs a build before deployment.",
  "frontend/src/App.tsx": "Main React app configuring TanStack Router, authentication gating, theme provider, and route definitions.",
  "frontend/src/backend.idl.ts": "Candid IDL factory defining all backend service types and methods for actor creation.",
  "frontend/src/components/auth/AuthGate.tsx": "Wraps children with authentication logic, showing loaders or login prompt depending on identity state.",
  "frontend/src/components/auth/LoginButton.tsx": "Renders login/logout button handling Internet Identity auth flow and related UI states.",
  "frontend/src/components/common/CryptoCard.tsx": "Reusable styled card component with optional glow effect.",
  "frontend/src/components/common/ErrorBanner.tsx": "Displays a destructive alert banner with an error message.",
  "frontend/src/components/common/NeonIndicator.tsx": "Shows a positive or negative percentage value with optional icon and color coding.",
  "frontend/src/components/invest/BuyNowDialog.tsx": "Modal for submitting an investment amount with validation and plan purchase mutation.",
  "frontend/src/components/invest/PlanCard.tsx": "Displays investment plan details and a Buy Now button inside a styled card.",
  "frontend/src/components/layout/AppShell.tsx": "Layout wrapper providing main content area and persistent bottom navigation.",
  "frontend/src/components/nav/BottomTabs.tsx": "Renders fixed bottom navigation tabs and routes between app sections.",
  "frontend/src/components/profile/ProfileOnboardingModal.tsx": "Modal for completing user profile with email and optional referral code submission.",
  "frontend/src/components/referrals/ReferralEarningsTable.tsx": "Displays referral earnings grouped by levels with stylized cards.",
  "frontend/src/components/referrals/ReferralStatsCards.tsx": "Shows referral statistics including team size and total earnings.",
  "frontend/src/components/wallet/DepositWithdrawCard.tsx": "Provides tabs for deposit and withdrawal forms with validation and wallet mutations.",
  "frontend/src/components/wallet/TransactionHistory.tsx": "Displays the user's latest transaction using wallet hooks, showing type, timestamp, amount, and status with loading and empty states.",
  "frontend/src/data/sampleMarket.ts": "Provides sample market data and a market overview object for UI display of crypto pairs and trends.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance based on Internet Identity, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Fetches and updates the caller's user profile using the actor with react-query caching.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity provider and hook for managing authentication, identity loading, and login state.",
  "frontend/src/hooks/useInvestmentPlans.ts": "Fetches investment plans and allows users to buy plans by creating investment and transaction records.",
  "frontend/src/hooks/useReferrals.ts": "Retrieves the caller's referral earnings from the backend via the actor.",
  "frontend/src/hooks/useWallet.ts": "Handles wallet balance retrieval and deposit/withdraw mutations, generating corresponding transaction records.",
  "frontend/src/index.css": "Defines global Tailwind styles, theme variables, crypto UI colors, and mobile optimizations.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider wrappers.",
  "frontend/src/pages/Futures.tsx": "Simple placeholder page showing a 'Coming Soon' message for futures trading.",
  "frontend/src/pages/Home.tsx": "Renders the home screen with hero banner, quick actions, market overview, and sample market list.",
  "frontend/src/pages/Invitation.tsx": "Referral dashboard page showing referral link, stats, and earnings table with copy-to-clipboard support.",
  "frontend/src/pages/Mine.tsx": "User profile page displaying email, referral link, and quick navigation actions with loading states.",
  "frontend/src/pages/News.tsx": "Placeholder news page showing a coming-soon message for crypto updates.",
  "frontend/src/pages/placeholders/Api.tsx": "Placeholder API page showing a coming-soon message for API documentation.",
  "frontend/src/pages/placeholders/ContractRecords.tsx": "Placeholder page for viewing past contract records with a no-records message.",
  "frontend/src/pages/placeholders/Contracts.tsx": "Placeholder page for active contracts showing a no-active-contracts message.",
  "frontend/src/pages/Quant.tsx": "Investment plans page that lists available plans and opens a buy dialog when selected.",
  "frontend/src/pages/Register.tsx": "Registration page that handles referral codes and triggers login flow if user is not authenticated.",
  "frontend/src/pages/Wallet.tsx": "Wallet page displaying balance, deposit/withdraw options, and transaction history.",
  "frontend/src/utils/referral.ts": "Utility functions for generating referral links and extracting referral codes from URLs.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, and clearing URL parameters including hash-based handling.",
  "frontend/src/utils/validation.ts": "Validation helpers for email format and numeric amount ranges.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration customizing colors, typography, container settings, and animations.",
  "project_state.json": "Defines the current project state for the Caffeine app including architecture notes, required features, known deployment issues, and existing implemented features with versions. Serves as a master state descriptor for planning and fixing build-related problems."
}